app/Controllers/ClientesController.php

    Public function index():string{

        $clientes =new ClientesModel();
        $datos['datos']=$clientes->findAll();
---
SELECT *
FROM `clientes`